# Brewfile for tools used in .zshrc
brew "stow"

# Shell enhancements
brew "starship"
brew "thefuck"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "wget"
brew "tldr"

# File management and viewers
brew "eza"
brew "bat"
brew "rm-improved"
brew "yazi"

# Version control
brew "git"
brew "gh"
brew "lazygit"
brew "kubernetes-cli"

# Installers
brew "rustup"

# Terminal
cask "kitty"
brew "tmux"

# Text editor
brew "neovim"
brew "tree-sitter-cli"

# Development tools
brew "mise"

# Casks
cask "bitwarden"
cask "arc"
cask "spotify"
