
# Brewfile for tools used in .zshrc
brew "stow"

# Shell enhancements
brew "starship"
brew "thefuck"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"

# File management and viewers
brew "eza"
brew "bat"
brew "rm-improved"

# Version control
brew "git"
brew "gh"
brew "lazygit"

# Text editor
brew "neovim"

# Terminal
cask "kitty"
brew "tmux"

# Development tools
brew "mise"

cask "bitwarden"
